### Python lists

In [24]:
[0.1, 0.2, 'a', 'b']

[0.1, 0.2, 'a', 'b']

### Numpy array

In [25]:
import numpy as np

np.array([0.1, 0.2, 0.3, 0.4])

array([0.1, 0.2, 0.3, 0.4])

### Pandas DataFrame

![title](pandas_df.png)

---
# <center><font color=purple>[pandas](https://pandas.pydata.org/)[docs](https://pandas.pydata.org/pandas-docs/stable/index.html)</font></center>
---

## Standard import

In [26]:
import pandas as pd

---
# <center> <font color=darkgreen>Creating a DataFrame</font></center>
---

## Create a DataFrame from a dictionary

In [27]:
df1 = pd.DataFrame({'A':[25,56,93] , 
                    'B':['str1','str2','str3']})

df1

    A     B
0  25  str1
1  56  str2
2  93  str3

### Change the index: [`set_index()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.set_index.html)

The default index is a list of integers. Use `set_index()` to assign a column to be the index.

In [28]:
df2 = df1.set_index('A')
df2

       B
A
25  str1
56  str2
93  str3

## Load data from an external source

In [29]:
# pd.read_

## Load a DataFrame from a file

In [30]:
CH = pd.read_csv('../data/celebrity-heights.csv')
CH

,id,firstname,midname,lastname,fullname,ftin,feet,inches,meters,gender
0,1,Verne,NaN,Troyer,Verne Troyer,2ft 8in,2,8.00,0.81280,M
1,8,Herve,NaN,Villechaize,Herve Villechaize,3ft 10in,3,10.00,1.16840,M
2,9,David,NaN,Rappaport,David Rappaport,3ft 11in,3,11.00,1.19380,M
3,2,Tony,NaN,Cox,Tony Cox,3ft 6in,3,6.00,1.06680,M
4,3,Warwick,NaN,Davis,Warwick Davis,3ft 6in,3,6.00,1.06680,M
...,...,...,...,...,...,...,...,...,...,...
5497,5499,General,NaN,Height,General Height,7ft 6.5in,7,6.50,2.29870,NaN
5498,5498,Matthew,NaN,McGrory,Matthew McGrory,7ft 6in,7,6.00,2.28600,M
5499,5500,Sandy,NaN,Allen,Sandy Allen,7ft 7.25in,7,7.25,2.31775,F
5500,5501,Sun,Ming,Ming,Sun Ming Ming,7ft 8.75in,7,8.75,2.35585,NaN
5501,5502,Robert,NaN,Wadlow,Robert Wadlow,8ft 11in,8,11.00,2.71780,M

In [31]:
#CH.set_index('fullname', inplace=True)
CH.iloc[[1,5,11,12],[1,3,5,6,7]]

   firstname     lastname      ftin  feet  inches
1      Herve  Villechaize  3ft 10in     3    10.0
5       Phil    Fondacaro   3ft 6in     3     6.0
11   Kristin    Chenoweth  4ft 10in     4    10.0
12     Danny       DeVito  4ft 10in     4    10.0

In [32]:
CH.set_index('fullname', inplace=True)
CH.head(8)

,id,firstname,midname,lastname,ftin,feet,inches,meters,gender
fullname,,,,,,,,,
Verne Troyer,1,Verne,NaN,Troyer,2ft 8in,2,8.0,0.8128,M
Herve Villechaize,8,Herve,NaN,Villechaize,3ft 10in,3,10.0,1.1684,M
David Rappaport,9,David,NaN,Rappaport,3ft 11in,3,11.0,1.1938,M
Tony Cox,2,Tony,NaN,Cox,3ft 6in,3,6.0,1.0668,M
Warwick Davis,3,Warwick,NaN,Davis,3ft 6in,3,6.0,1.0668,M
Phil Fondacaro,4,Phil,NaN,Fondacaro,3ft 6in,3,6.0,1.0668,M
Michael J Anderson,5,Michael,J,Anderson,3ft 7in,3,7.0,1.0922,M
Kenny Baker,6,Kenny,NaN,Baker,3ft 8in,3,8.0,1.1176,M

## Load a DataFrame from online data

+ We will load data on eductional attainment and personal income from the [California Open Data](https://data.ca.gov/dataset/ca-educational-attainment-personal-income/resource/26201f19-4469-4311-a819-bbbd3e557eda) portal. 
+ Go to the website, copy the URL and enter it below.

In [33]:
url = 'https://data.ca.gov/dataset/cea8cd18-9d21-4676-85de-d504ee2d4aab/resource/26201f19-4469-4311-a819-bbbd3e557eda/download/ca-educational-attainment-personal-income-2008-2014.csv'
table = pd.read_csv(url)

In [47]:
table.describe()

       Population Count
count      1.026000e+03
mean       1.855429e+05
std        2.187005e+05
min        1.048000e+03
25%        3.052250e+04
50%        9.039300e+04
75%        2.879518e+05
max        1.643095e+06

## DataFrame summaries
+ [info()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.info.html#): Column data types.
+ [describe()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html#): Summary statistics for numerical columns
+ [head()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.head.html), [tail()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.tail.html#pandas.DataFrame.tail) : Show first or last few rows of a table

In [35]:
table.tail(10)

,Year,Age,Gender,Educational Attainment,Personal Income,Population Count
1050,01/01/2014 12:00:00 AM,65 to 80+,Female,"Some college, less than 4-yr degree","$50,000 to $74,999",63144.0
1051,01/01/2014 12:00:00 AM,65 to 80+,Female,"Some college, less than 4-yr degree","$75,000 and over",54704.0
1052,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,No Income,15459.0
1053,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$5,000 to $9,999",62471.0
1054,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$10,000 to $14,999",104583.0
1055,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$15,000 to $24,999",82988.0
1056,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$25,000 to $34,999",59607.0
1057,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$35,000 to $49,999",113584.0
1058,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$50,000 to $74,999",97657.0
1059,01/01/2014 12:00:00 AM,65 to 80+,Female,Bachelor's degree or higher,"$75,000 and over",110009.0

---
# <center> <font color=darkgreen>Selecting data</font>  </center>
---

There are three basic ways to select data from a DataFrame. 

+ `[]`: Bracket selection
+ `.loc[]` : Label-based selection
+ `.iloc[]` : Integer-based selection

## `[]` Bracket selection

Syntax: `X[selector]`
+ To select columns the `selector` can be
    + A column label (string)
    + A list of column labels (list of strings)
+ To select rows the `selector` can be
    + A slice
    + A boolean mask

### Select a single column (string)

In [36]:
CH['firstname']

fullname
Verne Troyer           Verne
Herve Villechaize      Herve
David Rappaport        David
Tony Cox                Tony
Warwick Davis        Warwick
                      ...
General Height       General
Matthew McGrory      Matthew
Sandy Allen            Sandy
Sun Ming Ming            Sun
Robert Wadlow         Robert
Name: firstname, Length: 5502, dtype: object

### Select multiple columns (list of strings)

In [37]:
CH[['firstname', 'lastname']]

                  firstname     lastname
fullname
Verne Troyer          Verne       Troyer
Herve Villechaize     Herve  Villechaize
David Rappaport       David    Rappaport
Tony Cox               Tony          Cox
Warwick Davis       Warwick        Davis
...                     ...          ...
General Height      General       Height
Matthew McGrory     Matthew      McGrory
Sandy Allen           Sandy        Allen
Sun Ming Ming           Sun         Ming
Robert Wadlow        Robert       Wadlow

[5502 rows x 2 columns]

In [38]:
type(CH[['firstname','lastname']])

pandas.core.frame.DataFrame

### Select rows with slice indexing
[Slice indexing](https://docs.python.org/3/tutorial/introduction.html), in which you specify a start index, a stop index, and a step, works in the same way in Pandas as it does for regaular Python lists.

In [39]:
CH[2:]

,id,firstname,midname,lastname,ftin,feet,inches,meters,gender
fullname,,,,,,,,,
David Rappaport,9,David,NaN,Rappaport,3ft 11in,3,11.00,1.19380,M
Tony Cox,2,Tony,NaN,Cox,3ft 6in,3,6.00,1.06680,M
Warwick Davis,3,Warwick,NaN,Davis,3ft 6in,3,6.00,1.06680,M
Phil Fondacaro,4,Phil,NaN,Fondacaro,3ft 6in,3,6.00,1.06680,M
Michael J Anderson,5,Michael,J,Anderson,3ft 7in,3,7.00,1.09220,M
...,...,...,...,...,...,...,...,...,...
General Height,5499,General,NaN,Height,7ft 6.5in,7,6.50,2.29870,NaN
Matthew McGrory,5498,Matthew,NaN,McGrory,7ft 6in,7,6.00,2.28600,M
Sandy Allen,5500,Sandy,NaN,Allen,7ft 7.25in,7,7.25,2.31775,F
Sun Ming Ming,5501,Sun,Ming,Ming,7ft 8.75in,7,8.75,2.35585,NaN
Robert Wadlow,5502,Robert,NaN,Wadlow,8ft 11in,8,11.00,2.71780,M

### Select rows with a boolean mask

You can use a boolean list or a boolean Series as a mask for filtering rows.

In [40]:
CH.loc[CH['midname'] == 'J', 'lastname']

fullname
Michael J Anderson    Anderson
A J Langer              Langer
Michael J Fox              Fox
J J Moses                Moses
Brian J White            White
Sam J Jones              Jones
Name: lastname, dtype: object

## `loc[]` : Label-based selection

Syntax: `X.loc[rowselector,columnselector]` (`columnselector` is optional)
 
`rowselector` can be
+ An index (integer, string, date, etc.)
+ A list of indexes.
+ A slice (only if the index is integer-based)
+ A boolean mask

`columnselector` can be 
+ A string label. 
+ A list of strings labels.

### `.loc` can do (almost) anything `[]` can do

+ Except: .loc(slice) only works if the index is the integer-based default index. 
+ For column selection, use `.loc[:,columnselector]`

In [41]:
CH.loc[:,'gender']

fullname
Verne Troyer           M
Herve Villechaize      M
David Rappaport        M
Tony Cox               M
Warwick Davis          M
                    ...
General Height       NaN
Matthew McGrory        M
Sandy Allen            F
Sun Ming Ming        NaN
Robert Wadlow          M
Name: gender, Length: 5502, dtype: object

### Example: Select multiple rows and columns

In [42]:
CH.loc[CH['gender'] == 'M', ['firstname','meters','ftin']]

                   firstname  meters      ftin
fullname
Verne Troyer           Verne  0.8128   2ft 8in
Herve Villechaize      Herve  1.1684  3ft 10in
David Rappaport        David  1.1938  3ft 11in
Tony Cox                Tony  1.0668   3ft 6in
Warwick Davis        Warwick  1.0668   3ft 6in
...                      ...     ...       ...
Shaquille O'Neal   Shaquille  2.1590   7ft 1in
Ian Whyte                Ian  2.1590   7ft 1in
Kevin Peter Hall       Kevin  2.1844   7ft 2in
Matthew McGrory      Matthew  2.2860   7ft 6in
Robert Wadlow         Robert  2.7178  8ft 11in

[2651 rows x 3 columns]

### Example: Boolean masking

In [43]:
CH.loc[CH.index<10,['firstname','lastname','gender','meters']]

TypeError: '<' not supported between instances of 'str' and 'int'

## `iloc[]`:  Integer-based selection
    
Syntax: `iloc[rowselector,columnselector]` (`columnselector` is optional)
 
`rowselector` and `columnselector` can be
+ An integer or list of integers
+ A slice

    
### Examples

In [ ]:
CH.iloc[:10,[1,2]]

- First item
- Second item
- Third item
    - Indented item
    - Indented item
- Fourth item